// 1. Запитайте у юзера скільки йому років: «Привіт мені - “” років!».

let userName = +prompt('Скільки тобі років?');
alert (`Привіт мені ${userName} років!`);




// 2. Запитайтесь якого року народження юзер, теперішній рік візьмемо за константу. Виведемо скільки йому років.

const thisYear = 2020;
let yearOfBirth = +prompt('Твій рік народження');

if (thisYear > yearOfBirth  ){
    alert (`Тобі ${thisYear - yearOfBirth} років!`);
}else{
    alert ( 'Ти ще не народився, дурачок!')
};



// 3.Запитайтесь у юзера довжини сторін прямокутника та виведіть його периметр.

let width = +prompt ("Введіть ширину прямокутника");
let length = +prompt ("Введіть довжину приямокутника");
let p = (2*width) + (2*length);

alert (`Периметер прямокутника ${p}`);



// 4. Запитайтесь в юзера радіус кола та виведіть його площу.(число пі) 

let r = +prompt ('Введіть радіус кола');
let circleSquare = (r*r)*3.14;

alert (`Площа кола буде ${circleSquare}`);


//5. Водій їде з середньою швидкістю 50 км в годину. Запитайтесь у нього скільки ще йому необхідно часу їхати, та виведіть відстань

let speed = 50; // km/hr
let time = +prompt ("Скікльки часу ще їхати?");
let distance = speed * time ;

alert (`До кінцевої позиції залишилось ${distance}км.`);



//6.Реалізуємо конвертер кілометрів в милі і навпаки

let question = +prompt ('Якщо ви хочете перевести кілометри у милі натисність(1); Якщо ви хочете перевести милі в кілометри натисніть (2)');

if (question <= 1){
    let km = +prompt ('Вкажіть кількість кілометрів які необхідно перевести');
    let ml = km * 0.621371;
    alert (`${km}км це ${ml}миль` )
}else{
    let ml = +prompt ('Вкажіть кількість миль які необхідно перевести');
    let km = ml / 0.621371;
    alert (`${ml}мл це ${km}км` )
};

//7.Юзер вводить скільки коштів на його картці та ціну одного літра бензину. Виводимо скільки бензину він може купити та скільки грошей у нього залишиться.

let money = +prompt(`Вкажіть кількість коштів на рахунку`);
let price = +prompt(`Вкажіть ціну 1л бензину`);

let gasoline = money / price;
let remainder = ((money / price) *gasoline) - money;

if (remainder <= 0){
    remainder = 0;
}else{
    remainder = remainder;
};

alert (`Ви зможете купити ${gasoline}л. бензину , а ваш залишок буде ${ Math.round(remainder)}`);